The selected fixture is assigned to a system with different classification.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MismatchedSystemClassificationNoSystemWarning { get; }
  Visual Basic
Public Shared ReadOnly Property MismatchedSystemClassificationNoSystemWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MismatchedSystemClassificationNoSystemWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace